In [11]:
import pandas as pd

In [23]:
### read csv file

df = pd.read_csv("airlines.csv")
df

,Airport.Code,Airport.Name,Time.Label,Month,Time.Month Name,Time.Year,Statistics.# of Delays.Carrier,Statistics.# of Delays.Late Aircraft,Statistics.# of Delays.National Aviation System,Statistics.# of Delays.Security,...,Statistics.Flights.Delayed,Statistics.Flights.Diverted,Statistics.Flights.On Time,Statistics.Flights.Total,Statistics.Minutes Delayed.Carrier,Statistics.Minutes Delayed.Late Aircraft,Statistics.Minutes Delayed.National Aviation System,Statistics.Minutes Delayed.Security,Statistics.Minutes Delayed.Total,Statistics.Minutes Delayed.Weather
0,ATL,"Atlanta, GA: Hartsfield-Jackson Atlanta Intern...",2003/06,6,June,2003,1009,1275,3217,17,...,5843,27,23974,30060,61606,68335,118831,518,268764,19474
1,BOS,"Boston, MA: Logan International",2003/06,6,June,2003,374,495,685,3,...,1623,3,7875,9639,20319,28189,24400,99,77167,4160
2,BWI,"Baltimore, MD: Baltimore/Washington Internatio...",2003/06,6,June,2003,296,477,389,8,...,1245,15,6998,8287,13635,26810,17556,278,64480,6201
3,CLT,"Charlotte, NC: Charlotte Douglas International",2003/06,6,June,2003,300,472,735,2,...,1562,14,7021,8670,14763,23379,23804,127,65865,3792
4,DCA,"Washington, DC: Ronald Reagan Washington National",2003/06,6,June,2003,283,268,487,4,...,1100,18,5321,6513,13775,13712,20999,120,52747,4141
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1844,MDW,"Chicago, IL: Chicago Midway International",2008/09,9,September,2008,162,268,128,1,...,576,5,6327,6971,6727,11651,3661,33,23118,1046
1845,MIA,"Miami, FL: Miami International",2008/09,9,September,2008,244,190,370,-1,...,827,5,3736,4635,19850,12366,11713,5,45073,1135
1846,MSP,"Minneapolis, MN: Minneapolis-St Paul Internati...",2008/09,9,September,2008,304,236,320,3,...,889,17,8666,9634,23602,13261,10414,265,49517,1975
1847,ORD,"Chicago, IL: Chicago O'Hare International",2008/09,9,September,2008,916,1466,3509,5,...,6008,67,21529,28251,68440,97494,223965,105,398467,8463
1848,PDX,"Portland, OR: Portland International",2008/09,9,September,2008,161,169,136,0,...,476,1,4044,4535,7623,8927,3795,0,20794,449

In [13]:
### sliccing the csv data

df[0:20:5]

,Airport.Code,Airport.Name,Time.Label,Month,Time.Month Name,Time.Year,Statistics.# of Delays.Carrier,Statistics.# of Delays.Late Aircraft,Statistics.# of Delays.National Aviation System,Statistics.# of Delays.Security,...,Statistics.Flights.Delayed,Statistics.Flights.Diverted,Statistics.Flights.On Time,Statistics.Flights.Total,Statistics.Minutes Delayed.Carrier,Statistics.Minutes Delayed.Late Aircraft,Statistics.Minutes Delayed.National Aviation System,Statistics.Minutes Delayed.Security,Statistics.Minutes Delayed.Total,Statistics.Minutes Delayed.Weather
0,ATL,"Atlanta, GA: Hartsfield-Jackson Atlanta Intern...",2003/06,6,June,2003,1009,1275,3217,17,...,5843,27,23974,30060,61606,68335,118831,518,268764,19474
5,DEN,"Denver, CO: Denver International",2003/06,6,June,2003,516,323,664,11,...,1611,22,10024,11691,26634,18969,23538,706,75428,5581
10,IAD,"Washington, DC: Washington Dulles International",2003/06,6,June,2003,320,295,573,3,...,1256,35,7027,8419,16754,18074,25807,182,65529,4712
15,LGA,"New York, NY: LaGuardia",2003/06,6,June,2003,302,338,867,4,...,1604,22,7161,8908,17384,18954,41007,191,82859,5323

In [24]:
### to string

# print(df.to_string())

In [15]:
### list to Series

a = [1 , 5 , 9] ### list
new_a = pd.Series(a) ### series

new_a

0    1
1    5
2    9
dtype: int64

In [16]:
new_a[2]

np.int64(9)

In [17]:
### dictionary to Series

b = {
    "name" : "Ayush",
    "age" : "20",
    "Univeristy" : "Iar"
}

new_b = pd.Series(b)
new_b

name          Ayush
age              20
Univeristy      Iar
dtype: object

In [18]:
### converting the Dictionary into DataFrame

data = {
    'DOB' : [1402 , 2505 , 1205],
    'age' : [18 , 19 , 25]
}

DataFrame_Data = pd.DataFrame(data)
DataFrame_Data

    DOB  age
0  1402   18
1  2505   19
2  1205   25

In [19]:
DataFrame_Data.loc[0]

DOB    1402
age      18
Name: 0, dtype: int64

In [20]:
DataFrame_Data.loc[1]

DOB    2505
age      19
Name: 1, dtype: int64

In [34]:
airlines = pd.read_csv("airlines.csv")

In [36]:
### displays the Row Data for [Start , Stop , Step]
airlines.loc[0:1]

,Airport.Code,Airport.Name,Time.Label,Month,Time.Month Name,Time.Year,Statistics.# of Delays.Carrier,Statistics.# of Delays.Late Aircraft,Statistics.# of Delays.National Aviation System,Statistics.# of Delays.Security,...,Statistics.Flights.Delayed,Statistics.Flights.Diverted,Statistics.Flights.On Time,Statistics.Flights.Total,Statistics.Minutes Delayed.Carrier,Statistics.Minutes Delayed.Late Aircraft,Statistics.Minutes Delayed.National Aviation System,Statistics.Minutes Delayed.Security,Statistics.Minutes Delayed.Total,Statistics.Minutes Delayed.Weather
0,ATL,"Atlanta, GA: Hartsfield-Jackson Atlanta Intern...",2003/06,6,June,2003,1009,1275,3217,17,...,5843,27,23974,30060,61606,68335,118831,518,268764,19474
1,BOS,"Boston, MA: Logan International",2003/06,6,June,2003,374,495,685,3,...,1623,3,7875,9639,20319,28189,24400,99,77167,4160

In [49]:
### var_name[start-row : end-row , [col-names-1 , col-names-2]]

airlines.loc[0:10 , ["Airport.Code" , "Month" , "Time.Year"]]

   Airport.Code  Month  Time.Year
0           ATL      6       2003
1           BOS      6       2003
2           BWI      6       2003
3           CLT      6       2003
4           DCA      6       2003
5           DEN      6       2003
6           DFW      6       2003
7           DTW      6       2003
8           EWR      6       2003
9           FLL      6       2003
10          IAD      6       2003

In [56]:
### iloc[start : end]

airlines.iloc[12:45]

,Airport.Code,Airport.Name,Time.Label,Month,Time.Month Name,Time.Year,Statistics.# of Delays.Carrier,Statistics.# of Delays.Late Aircraft,Statistics.# of Delays.National Aviation System,Statistics.# of Delays.Security,...,Statistics.Flights.Delayed,Statistics.Flights.Diverted,Statistics.Flights.On Time,Statistics.Flights.Total,Statistics.Minutes Delayed.Carrier,Statistics.Minutes Delayed.Late Aircraft,Statistics.Minutes Delayed.National Aviation System,Statistics.Minutes Delayed.Security,Statistics.Minutes Delayed.Total,Statistics.Minutes Delayed.Weather
12,JFK,"New York, NY: John F. Kennedy International",2003/06,6,June,2003,376,226,394,21,...,1046,13,4695,5778,22029,11593,14103,659,50335,1951
13,LAS,"Las Vegas, NV: McCarran International",2003/06,6,June,2003,511,678,624,17,...,1893,6,9821,11759,24293,31043,19561,808,79533,3828
14,LAX,"Los Angeles, CA: Los Angeles International",2003/06,6,June,2003,830,765,842,37,...,2571,10,15780,18462,40089,39655,26162,2559,114434,5969
15,LGA,"New York, NY: LaGuardia",2003/06,6,June,2003,302,338,867,4,...,1604,22,7161,8908,17384,18954,41007,191,82859,5323
16,MCO,"Orlando, FL: Orlando International",2003/06,6,June,2003,368,434,535,3,...,1388,9,6211,7617,17707,26116,18073,56,65140,3188
17,MDW,"Chicago, IL: Chicago Midway International",2003/06,6,June,2003,180,411,311,12,...,951,6,6057,7061,8535,20938,10702,331,42962,2456
18,MIA,"Miami, FL: Miami International",2003/06,6,June,2003,247,210,585,2,...,1105,22,3745,4900,12609,12700,22976,66,52191,3840
19,MSP,"Minneapolis, MN: Minneapolis-St Paul Internati...",2003/06,6,June,2003,428,376,759,9,...,1678,11,10404,12194,27468,20994,23137,529,78259,6131
20,ORD,"Chicago, IL: Chicago O'Hare International",2003/06,6,June,2003,801,982,2947,11,...,4899,38,24997,30195,54296,55855,135851,604,257007,10401
21,PDX,"Portland, OR: Portland International",2003/06,6,June,2003,193,248,213,11,...,684,5,4040,4746,8260,11909,5943,505,27645,1028
22,PHL,"Philadelphia, PA: Philadelphia International",2003/06,6,June,2003,338,565,1083,1,...,2049,20,6917,9069,16478,31005,45538,21,97173,4131
23,PHX,"Phoenix, AZ: Phoenix Sky Harbor International",2003/06,6,June,2003,491,569,664,19,...,1783,10,12158,14008,26512,27458,18673,768,76031,2620
24,SAN,"San Diego, CA: San Diego International",2003/06,6,June,2003,324,349,341,8,...,1052,4,5775,6851,15034,15747,10449,223,43215,1762
25,SEA,"Seattle, WA: Seattle/Tacoma International",2003/06,6,June,2003,448,552,454,28,...,1516,9,7658,9246,22647,28119,13860,1097,68673,2950
26,SFO,"San Francisco, CA: San Francisco International",2003/06,6,June,2003,416,312,1080,14,...,1880,9,8211,10183,22673,17879,45407,1138,90487,3390
27,SLC,"Salt Lake City, UT: Salt Lake City International",2003/06,6,June,2003,363,290,352,15,...,1057,0,9491,10582,16227,13883,10512,556,42863,1685
28,TPA,"Tampa, FL: Tampa International",2003/06,6,June,2003,226,327,524,3,...,1122,11,4256,5401,11012,18558,19078,112,51364,2604
29,ATL,"Atlanta, GA: Hartsfield-Jackson Atlanta Intern...",2003/07,7,July,2003,1259,1791,4022,13,...,7452,71,22868,30875,87261,116728,184740,356,418274,29189
30,BOS,"Boston, MA: Logan International",2003/07,7,July,2003,450,587,609,0,...,1710,3,8033,9972,28610,36619,26923,10,97186,5024
31,BWI,"Baltimore, MD: Baltimore/Washington Internatio...",2003/07,7,July,2003,387,646,544,4,...,1679,20,6855,8611,18395,42876,28654,81,100157,10151
32,CLT,"Charlotte, NC: Charlotte Douglas International",2003/07,7,July,2003,335,542,945,0,...,1895,24,6883,8965,17830,32502,37630,0,94531,6569
33,DCA,"Washington, DC: Ronald Reagan Washington National",2003/07,7,July,2003,343,270,573,3,...,1260,13,5241,6695,17776,18002,25897,111,67839,6053
34,DEN,"Denver, CO: Denver International",2003/07,7,July,2003,562,434,646,2,...,1753,9,10869,12702,29155,30028,25912,87,91893,6711
35,DFW,"Dallas/Fort Worth, TX: Dallas/Fort Worth Inter...",2003/07,7,July,2003,1216,1443,2081,18,...,5003,64,22982,28323,78047,83156,80740,447,258631,16241
36,DTW,"Detroit, MI: Detroit Metro Wayne County",2003/07,7,July,2003,475,448,816,4,...,1891,22,10104,12192,33660,26421,30809,137,103913,12886
37,EWR,"Newark, NJ: Newark Liberty International",2003/07,7,July,2003,410,706,1665,11,...,2917,59,9797,13058,27536,45894,95872,295,180839,11242
38,FLL,"Fort Lauderdale, FL: Fort Lauderdale-Hollywood...",2003/07,7,July,2003,262,328,412,6,...,1041,1,3785,4846,13333,21007,15824,172,52714,2378
39,IAD,"Washington, DC: Washington Dulles International",2003/07,7,July,2003,395,406,671,10,...,1567,14,6990,8788,22887,26373,35084,309,92720,8067
40,IAH,"Houston, TX: George Bush Intercontinental/Houston",2003/07,7,July,2003,441,960,1506,9,...,3031,77,13269,16467,27204,52723,52976,221,141506,8382
41,JFK,"New York, NY: John F. Kennedy International",2003/07,7,July,2003,347,231,455,12,...,1082,24,5067,6205,21108,13117,16836,362,54400,2977
42,LAS,"Las Vegas, NV: McCarran International",2003/07,7,July,2003,560,760,570,8,...,1998,52,10083,12206,30498,44219,26557,210,110270,8786
43,LAX,"Los Angeles, CA: Los Angeles International",2003/07,7,July,2003,864,807,557,12,...,2380,10,16760,19295,45717,47458,23552,224,126984,10033
44,LGA,"New York, NY: LaGuardia",2003/07,7,July,2003,336,434,1060,0,...,1934,63,7012,9294,20643,27725,61204,12,117366,7782

In [59]:
### .iloc[[rows.indexes],[coloumn.indexes]]

airlines.iloc[[0,1,2],[0,5]]

  Airport.Code  Time.Year
0          ATL       2003
1          BOS       2003
2          BWI       2003

In [66]:
cg = pd.read_csv("university.csv")
cg

,CollegeID,CollegeName,City,State,EstablishedYear,Tuition,Enrollment,Website
0,1001,Summit University,Boulder,CO,1902,45000.0,12000.0,www.summit.edu
1,1002,Ridgeview College,Portland,OR,1955,NaN,22000.0,www.ridgeview.edu
2,1003,Lakefront Tech,NaN,CA,1981,38000.0,8500.0,NaN
3,1004,Metropolis State,Chicago,IL,1899,29500.0,NaN,www.metrostate.edu
4,1005,Avalon Arts Institute,New York,NaN,2005,NaN,3200.0,www.avalonarts.org
5,1006,Pioneer Community College,Austin,TX,1973,8500.0,19500.0,www.pioneercc.tx
6,1007,Northern Technical,Boston,MA,1968,32000.0,7800.0,NaN
7,1008,Crestwood University,NaN,NY,1924,51000.0,9100.0,www.crestwood.edu

In [70]:
### top (numbers(index)) of datafram

cg.head(5)

,CollegeID,CollegeName,City,State,EstablishedYear,Tuition,Enrollment,Website
0,1001,Summit University,Boulder,CO,1902,45000.0,12000.0,www.summit.edu
1,1002,Ridgeview College,Portland,OR,1955,NaN,22000.0,www.ridgeview.edu
2,1003,Lakefront Tech,NaN,CA,1981,38000.0,8500.0,NaN
3,1004,Metropolis State,Chicago,IL,1899,29500.0,NaN,www.metrostate.edu
4,1005,Avalon Arts Institute,New York,NaN,2005,NaN,3200.0,www.avalonarts.org

In [76]:
### bottom (numbers(index)) of datafram

cg.tail(5)

,CollegeID,CollegeName,City,State,EstablishedYear,Tuition,Enrollment,Website
3,1004,Metropolis State,Chicago,IL,1899,29500.0,NaN,www.metrostate.edu
4,1005,Avalon Arts Institute,New York,NaN,2005,NaN,3200.0,www.avalonarts.org
5,1006,Pioneer Community College,Austin,TX,1973,8500.0,19500.0,www.pioneercc.tx
6,1007,Northern Technical,Boston,MA,1968,32000.0,7800.0,NaN
7,1008,Crestwood University,NaN,NY,1924,51000.0,9100.0,www.crestwood.edu

In [77]:
cg

,CollegeID,CollegeName,City,State,EstablishedYear,Tuition,Enrollment,Website
0,1001,Summit University,Boulder,CO,1902,45000.0,12000.0,www.summit.edu
1,1002,Ridgeview College,Portland,OR,1955,NaN,22000.0,www.ridgeview.edu
2,1003,Lakefront Tech,NaN,CA,1981,38000.0,8500.0,NaN
3,1004,Metropolis State,Chicago,IL,1899,29500.0,NaN,www.metrostate.edu
4,1005,Avalon Arts Institute,New York,NaN,2005,NaN,3200.0,www.avalonarts.org
5,1006,Pioneer Community College,Austin,TX,1973,8500.0,19500.0,www.pioneercc.tx
6,1007,Northern Technical,Boston,MA,1968,32000.0,7800.0,NaN
7,1008,Crestwood University,NaN,NY,1924,51000.0,9100.0,www.crestwood.edu

In [93]:
### will remove row data if any null value occures form the CSV file

drop_cg = pd.read_csv("university.csv")
dropped_cg = drop_cg.dropna()


dropped_cg

,CollegeID,CollegeName,City,State,EstablishedYear,Tuition,Enrollment,Website
0,1001,Summit University,Boulder,CO,1902,45000.0,12000.0,www.summit.edu
5,1006,Pioneer Community College,Austin,TX,1973,8500.0,19500.0,www.pioneercc.tx

In [95]:
inplace_cg = cg.dropna(inplace = True)

print(cg.to_string())

   CollegeID                CollegeName     City State  EstablishedYear  Tuition  Enrollment           Website
0       1001          Summit University  Boulder    CO             1902  45000.0     12000.0    www.summit.edu
5       1006  Pioneer Community College   Austin    TX             1973   8500.0     19500.0  www.pioneercc.tx

In [92]:
cg

,CollegeID,CollegeName,City,State,EstablishedYear,Tuition,Enrollment,Website
0,1001,Summit University,Boulder,CO,1902,45000.0,12000.0,www.summit.edu
5,1006,Pioneer Community College,Austin,TX,1973,8500.0,19500.0,www.pioneercc.tx

In [99]:
uni = pd.read_csv("new-uni.csv")
uni

,UniversityID,UniversityName,City,State,Country,EstablishedYear,Type,StudentPopulation
0,1,Springfield University,Springfield,IL,USA,1901,Public,12500.0
1,2,Riverside College,Riverside,CA,USA,1895,Private,8200.0
2,3,Maplewood Institute,Toronto,ON,Canada,1923,Public,21000.0
3,4Kingston University,London,NaN,UK,1899,Public,19000,NaN
4,5,Summit Peak University,Denver,CO,USA,1950,Private,6500.0
5,6,Bayside Technical College,Sydney,NSW,Australia,1968,Public,14200.0
6,7,Université de la Lune,Paris,NaN,France,1750,Public,28000.0
7,8,Green Valley State,Burlington,VT,USA,1933,Public,9100.0
8,9,Redwood University,Palo Alto,CA,USA,1980,Private,11500.0
9,10,Northern Lights University,Oslo,NaN,Norway,1947,Public,16000.0
10,11,Ironwood College,Pittsburgh,PA,USA,1905,Private,7300.0
11,12,Oceanview University,Miami,FL,USA,1965,Public,31000.0
12,13,Mount Royal University,Calgary,AB,Canada,1910,Public,14500.0
13,14,Kyoto Future University,Kyoto,NaN,Japan,1988,Private,9000.0
14,15,Berlin Institute of Arts,Berlin,NaN,Germany,1920,Public,10500.0
15,16,Lone Star University,Austin,TX,USA,1883,Public,45000.0
16,17,Willow Creek Community College,Salem,OR,USA,1972,Public,5800.0
17,18,Victoria University of Manchester,Manchester,NaN,UK,1851,Public,38000.0
18,19,Desert Rock University,Phoenix,AZ,USA,1958,Public,29500.0
19,20,Lakefront University,Chicago,IL,USA,1890,Private,17000.0
20,21,Trinity College Dublin,Dublin,NaN,Ireland,1592,Public,18000.0
21,22,Pacific Rim University,Vancouver,BC,Canada,1908,Public,42000.0
22,23,Midlands University,Omaha,NE,USA,1940,Private,4500.0
23,24,Coastal University of Singapore,Singapore,NaN,Singapore,2005,Public,24000.0
24,25,Evergreen State College,Olympia,WA,USA,1967,Public,4300.0
25,26,Universidad del Sol,Madrid,NaN,Spain,1499,Public,33000.0
26,27,Gateway Technical Institute,St. Louis,MO,USA,1960,Public,11200.0
27,28,Prairie View University,Winnipeg,MB,Canada,1877,Public,13000.0
28,29,Alpine University of Switzerland,Geneva,NaN,Switzerland,1559,Public,17500.0
29,30,Harborview University,Boston,MA,USA,1863,Private,22000.0
30,31,Central Metropolitan University,New York,NY,USA,1930,Public,35000.0
31,32,Southern Cross University,Melbourne,VIC,Australia,1994,Public,15000.0
32,33,University of Auckland,Auckland,NaN,New Zealand,1883,Public,34000.0
33,34,Stonewall College,Richmond,VA,USA,1830,Private,6800.0
34,35,Quantum University of Delhi,Delhi,NaN,India,1990,Private,12000.0
35,36,Silverado University,Las Vegas,NV,USA,1957,Public,25000.0
36,37,University of the North,Stockholm,NaN,Sweden,1668,Public,20000.0
37,38,Blue Ridge University,Asheville,NC,USA,1927,Public,8900.0
38,39,Golden Gate University,San Francisco,CA,USA,1901,Private,5300.0
39,40,Keystone University,Philadelphia,PA,USA,1855,Public,41000.0
40,41,University of São Paulo,São Paulo,NaN,Brazil,1934,Public,58000.0
41,42,Heritage College,Quebec City,QC,Canada,1760,Private,3900.0
42,43,University of Cape Town,Cape Town,NaN,South Africa,1829,Public,26000.0
43,44,Pinecrest University,Atlanta,GA,USA,1911,Private,15500.0
44,45,Canyonlands University,Salt Lake City,UT,USA,1850,Public,32000.0
45,46,River Thames College,Oxford,NaN,UK,1209,Public,24000.0
46,47,Seoul National University,Seoul,NaN,South Korea,1946,Public,28500.0
47,48,Midnight Sun University,Helsinki,NaN,Finland,1640,Public,19500.0
48,49,Delta State University,New Orleans,LA,USA,1924,Public,13000.0
49,50,Twin Cities University,Minneapolis,MN,USA,1851,Public,51000.0

In [104]:
# uni.isnull()

In [112]:
### column wise list of null values

uni.isnull().sum().sum()

np.int64(19)

In [111]:
tot_nulls = uni.isna().sum().sum()

tot_nulls

np.int64(19)

In [6]:
import pandas as pd

uni = pd.read_csv("new-uni.csv")
uni

,UniversityID,UniversityName,City,State,Country,EstablishedYear,Type,StudentPopulation
0,1,Springfield University,Springfield,IL,USA,1901,Public,12500.0
1,2,Riverside College,Riverside,CA,USA,1895,Private,8200.0
2,3,Maplewood Institute,Toronto,ON,Canada,1923,Public,21000.0
3,4Kingston University,London,NaN,UK,1899,Public,19000,NaN
4,5,Summit Peak University,Denver,CO,USA,1950,Private,6500.0
5,6,Bayside Technical College,Sydney,NSW,Australia,1968,Public,14200.0
6,7,Université de la Lune,Paris,NaN,France,1750,Public,28000.0
7,8,Green Valley State,Burlington,VT,USA,1933,Public,9100.0
8,9,Redwood University,Palo Alto,CA,USA,1980,Private,11500.0
9,10,Northern Lights University,Oslo,NaN,Norway,1947,Public,16000.0
10,11,Ironwood College,Pittsburgh,PA,USA,1905,Private,7300.0
11,12,Oceanview University,Miami,FL,USA,1965,Public,31000.0
12,13,Mount Royal University,Calgary,AB,Canada,1910,Public,14500.0
13,14,Kyoto Future University,Kyoto,NaN,Japan,1988,Private,9000.0
14,15,Berlin Institute of Arts,Berlin,NaN,Germany,1920,Public,10500.0
15,16,Lone Star University,Austin,TX,USA,1883,Public,45000.0
16,17,Willow Creek Community College,Salem,OR,USA,1972,Public,5800.0
17,18,Victoria University of Manchester,Manchester,NaN,UK,1851,Public,38000.0
18,19,Desert Rock University,Phoenix,AZ,USA,1958,Public,29500.0
19,20,Lakefront University,Chicago,IL,USA,1890,Private,17000.0
20,21,Trinity College Dublin,Dublin,NaN,Ireland,1592,Public,18000.0
21,22,Pacific Rim University,Vancouver,BC,Canada,1908,Public,42000.0
22,23,Midlands University,Omaha,NE,USA,1940,Private,4500.0
23,24,Coastal University of Singapore,Singapore,NaN,Singapore,2005,Public,24000.0
24,25,Evergreen State College,Olympia,WA,USA,1967,Public,4300.0
25,26,Universidad del Sol,Madrid,NaN,Spain,1499,Public,33000.0
26,27,Gateway Technical Institute,St. Louis,MO,USA,1960,Public,11200.0
27,28,Prairie View University,Winnipeg,MB,Canada,1877,Public,13000.0
28,29,Alpine University of Switzerland,Geneva,NaN,Switzerland,1559,Public,17500.0
29,30,Harborview University,Boston,MA,USA,1863,Private,22000.0
30,31,Central Metropolitan University,New York,NY,USA,1930,Public,35000.0
31,32,Southern Cross University,Melbourne,VIC,Australia,1994,Public,15000.0
32,33,University of Auckland,Auckland,NaN,New Zealand,1883,Public,34000.0
33,34,Stonewall College,Richmond,VA,USA,1830,Private,6800.0
34,35,Quantum University of Delhi,Delhi,NaN,India,1990,Private,12000.0
35,36,Silverado University,Las Vegas,NV,USA,1957,Public,25000.0
36,37,University of the North,Stockholm,NaN,Sweden,1668,Public,20000.0
37,38,Blue Ridge University,Asheville,NC,USA,1927,Public,8900.0
38,39,Golden Gate University,San Francisco,CA,USA,1901,Private,5300.0
39,40,Keystone University,Philadelphia,PA,USA,1855,Public,41000.0
40,41,University of São Paulo,São Paulo,NaN,Brazil,1934,Public,58000.0
41,42,Heritage College,Quebec City,QC,Canada,1760,Private,3900.0
42,43,University of Cape Town,Cape Town,NaN,South Africa,1829,Public,26000.0
43,44,Pinecrest University,Atlanta,GA,USA,1911,Private,15500.0
44,45,Canyonlands University,Salt Lake City,UT,USA,1850,Public,32000.0
45,46,River Thames College,Oxford,NaN,UK,1209,Public,24000.0
46,47,Seoul National University,Seoul,NaN,South Korea,1946,Public,28500.0
47,48,Midnight Sun University,Helsinki,NaN,Finland,1640,Public,19500.0
48,49,Delta State University,New Orleans,LA,USA,1924,Public,13000.0
49,50,Twin Cities University,Minneapolis,MN,USA,1851,Public,51000.0

In [14]:
rows_one_null = uni[uni.isnull().sum(axis=1) == 1]
print(uni.isnull().sum(axis=1) == 1)
rows_one_null

rows_multi_null = uni[uni.isnull().sum(axis=1) >= 1]
rows_multi_null

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9      True
10    False
11    False
12    False
13     True
14     True
15    False
16    False
17     True
18    False
19    False
20     True
21    False
22    False
23     True
24    False
25     True
26    False
27    False
28     True
29    False
30    False
31    False
32     True
33    False
34     True
35    False
36     True
37    False
38    False
39    False
40     True
41    False
42     True
43    False
44    False
45     True
46     True
47     True
48    False
49    False
dtype: bool

,UniversityID,UniversityName,City,State,Country,EstablishedYear,Type,StudentPopulation
3,4Kingston University,London,NaN,UK,1899,Public,19000,NaN
6,7,Université de la Lune,Paris,NaN,France,1750,Public,28000.0
9,10,Northern Lights University,Oslo,NaN,Norway,1947,Public,16000.0
13,14,Kyoto Future University,Kyoto,NaN,Japan,1988,Private,9000.0
14,15,Berlin Institute of Arts,Berlin,NaN,Germany,1920,Public,10500.0
17,18,Victoria University of Manchester,Manchester,NaN,UK,1851,Public,38000.0
20,21,Trinity College Dublin,Dublin,NaN,Ireland,1592,Public,18000.0
23,24,Coastal University of Singapore,Singapore,NaN,Singapore,2005,Public,24000.0
25,26,Universidad del Sol,Madrid,NaN,Spain,1499,Public,33000.0
28,29,Alpine University of Switzerland,Geneva,NaN,Switzerland,1559,Public,17500.0
32,33,University of Auckland,Auckland,NaN,New Zealand,1883,Public,34000.0
34,35,Quantum University of Delhi,Delhi,NaN,India,1990,Private,12000.0
36,37,University of the North,Stockholm,NaN,Sweden,1668,Public,20000.0
40,41,University of São Paulo,São Paulo,NaN,Brazil,1934,Public,58000.0
42,43,University of Cape Town,Cape Town,NaN,South Africa,1829,Public,26000.0
45,46,River Thames College,Oxford,NaN,UK,1209,Public,24000.0
46,47,Seoul National University,Seoul,NaN,South Korea,1946,Public,28500.0
47,48,Midnight Sun University,Helsinki,NaN,Finland,1640,Public,19500.0